#include <stdio.h>

void multiple_array()
{
    int arr[2][3] = { {10, 20, 30}, { 10, 20, 30 } };
    int arr[5][3] = { {10, 20, 30}, { 10, 20, 30 } };
    int arr[10][3] = { {10, 20, 30}, { 10, 20, 30 } };

    int n1 = 0, n2 = 1, n3 = 2;
    int* ptrs[3];   // 포인터형 배열
    ptrs[0] = &n1;
    ptrs[1] = &n2;
    ptrs[2] = &n3;

    int(*ptrs2)[3]; // 배열 포인터

    int score[3][5][3] = { 
        {
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }  // 1명
        },
        {
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }  // 1명
        },
        {
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }, // 1명
            { 80, 90, 70 }  // 1명
        }
    };

    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            for (int k = 0; k < 3; k++)
            {
                printf("score[%d][%d][%d] = %d\n", i, j, k, score[i][j][k]);
            }
        }
    }
}


int main()
{
    multiple_array();

    return 0;
}
